#include <stdio.h>

int main() {
    double m1, v1, m2, v2;
    double d1, d2; 

    printf("Введіть масу та об'єм 1-го тіла: ");
    scanf("%lf %lf", &m1, &v1);

    printf("Введіть масу та об'єм 2-го тіла: ");
    scanf("%lf %lf", &m2, &v2);

    if (v1 <= 0 || v2 <= 0) {
        printf("Помилка: об'єм не може бути 0 або менше.\n");
    } 
    else {
        d1 = m1 / v1; // Щільність першого
        d2 = m2 / v2; // Щільність другого

        if (d1 > d2) {
            printf("У першого тіла щільність більша.\n");
        } 
        else if (d2 > d1) {
            printf("У другого тіла щільність більша.\n");
        } 
        else {
            printf("Щільності однакові.\n");
        }
    }
    return 0;
}
